RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_timer.h
/* TIMER_AFCTL1 */
#define TIMER_AFCTL1_BRK1IN0EN           BIT(0)                                     /*!< BREAK1 BRKIN0 alternate function input enable */
#define TIMER_AFCTL1_BRK1IN1EN           BIT(1)                                     /*!< BREAK1 BRKIN1 alternate function input enable */
#define TIMER_AFCTL1_BRK1IN2EN           BIT(2)                                     /*!< BREAK1 BRKIN2 alternate function input enable */
#define TIMER_AFCTL1_BRK1HPDFEN          BIT(8)                                     /*!< BREAK1 HPDF input enable */
#define TIMER_AFCTL1_BRK1CMP0EN          BIT(9)                                     /*!< BREAK1 CMP0 enable */
#define TIMER_AFCTL1_BRK1CMP1EN          BIT(10)                                    /*!< BREAK1 CMP1 enable */
#define TIMER_AFCTL1_BRK1IN0P            BIT(16)                                    /*!< BREAK1 BRKIN0 alternate function input polarity */
#define TIMER_AFCTL1_BRK1IN1P            BIT(17)                                    /*!< BREAK1 BRKIN1 alternate function input polarity */
#define TIMER_AFCTL1_BRK1IN2P            BIT(18)                                    /*!< BREAK1 BRKIN2 alternate function input polarity */
#define TIMER_AFCTL1_BRK1CMP0P           BIT(25)                                    /*!< BREAK1 CMP0 input polarity */
#define TIMER_AFCTL1_BRK1CMP1P           BIT(26)                                    /*!< BREAK1 CMP1 input polarity */

/* TIMER_WDGPER */
#define TIMER_WDGPER_WDGPER              BITS(0,31)                                 /*!< watchdog counter period value */

/* TIMER_CREP1 */
#define TIMER_CREP1_CREP1                BITS(0,31)                                 /*!< counter repetition value 1 */

/* TIMER_CHBRKCTL */
#define TIMER_CHBRKCTL_CH0BRKMIE         BIT(0)                                     /*!< channel 0 BREAK multi-period interrupt enable */
#define TIMER_CHBRKCTL_CH1BRKMIE         BIT(1)                                     /*!< channel 1 BREAK multi-period interrupt enable */
#define TIMER_CHBRKCTL_CH2BRKMIE         BIT(2)                                     /*!< channel 2 BREAK multi-period interrupt enable */
#define TIMER_CHBRKCTL_CH3BRKMIE         BIT(3)                                     /*!< channel 3 BREAK multi-period interrupt enable */
#define TIMER_CHBRKCTL_CH0BRKINP         BIT(4)                                     /*!< channel 0 BREAK input signal polarity */
#define TIMER_CHBRKCTL_CH1BRKINP         BIT(5)                                     /*!< channel 1 BREAK input signal polarity */
#define TIMER_CHBRKCTL_CH2BRKINP         BIT(6)                                     /*!< channel 2 BREAK input signal polarity */
#define TIMER_CHBRKCTL_CH3BRKINP         BIT(7)                                     /*!< channel 3 BREAK input signal polarity */
#define TIMER_CHBRKCTL_CH0BRKIE          BIT(8)                                     /*!< channel 0 BREAK interrupt enable */
#define TIMER_CHBRKCTL_CH1BRKIE          BIT(9)                                     /*!< channel 1 BREAK interrupt enable */
#define TIMER_CHBRKCTL_CH2BRKIE          BIT(10)                                    /*!< channel 2 BREAK interrupt enable */
#define TIMER_CHBRKCTL_CH3BRKIE          BIT(11)                                    /*!< channel 3 BREAK interrupt enable */
#define TIMER_CHBRKCTL_CH0BRKINEN        BIT(12)                                    /*!< channel 0 BREAK input signal enable */
#define TIMER_CHBRKCTL_CH1BRKINEN        BIT(13)                                    /*!< channel 1 BREAK input signal enable */
#define TIMER_CHBRKCTL_CH2BRKINEN        BIT(14)                                    /*!< channel 2 BREAK input signal enable */
#define TIMER_CHBRKCTL_CH3BRKINEN        BIT(15)                                    /*!< channel 3 BREAK input signal enable */
#define TIMER_CHBRKCTL_CHPOEN0           BIT(20)                                    /*!< channel primary output enable 0 */
#define TIMER_CHBRKCTL_CHPOEN1           BIT(21)                                    /*!< channel primary output enable 1 */
#define TIMER_CHBRKCTL_CHPOEN2           BIT(22)                                    /*!< channel primary output enable 2 */
#define TIMER_CHBRKCTL_CHPOEN3           BIT(23)                                    /*!< channel primary output enable 3 */

/* TIMER_CHBRKPER */
#define TIMER_CHBRKPER_PERCNT            BITS(0,15)                                 /*!< channel BREAK period count */

/* TIMER_CHBRKINTF */
#define TIMER_CHBRKINTF_CH0BRKMIF        BIT(0)                                     /*!< channel 0 BREAK multi-period interrupt flag */
#define TIMER_CHBRKINTF_CH1BRKMIF        BIT(1)                                     /*!< channel 1 BREAK multi-period interrupt flag */
#define TIMER_CHBRKINTF_CH2BRKMIF        BIT(2)                                     /*!< channel 2 BREAK multi-period interrupt flag */
#define TIMER_CHBRKINTF_CH3BRKMIF        BIT(3)                                     /*!< channel 3 BREAK multi-period interrupt flag */
#define TIMER_CHBRKINTF_CH0BRKIF         BIT(4)                                     /*!< channel 0 BREAK interrupt flag */
#define TIMER_CHBRKINTF_CH1BRKIF         BIT(5)                                     /*!< channel 1 BREAK interrupt flag */
#define TIMER_CHBRKINTF_CH2BRKIF         BIT(6)                                     /*!< channel 2 BREAK interrupt flag */
#define TIMER_CHBRKINTF_CH3BRKIF         BIT(7)                                     /*!< channel 3 BREAK interrupt flag */

/* TIMER_DMACFG */
#define TIMER_DMACFG_DMATA               BITS(0,5)                                  /*!< DMA transfer access start address */
#define TIMER_DMACFG_DMATC               BITS(8,13)                                 /*!< DMA transfer count */

/* TIMER_DMATB */
#define TIMER_DMATB_DMATB                BITS(0,31)                                 /*!< DMA transfer buffer */

/* TIMER_CFG */
#define TIMER_CFG_OUTSEL                 BIT(0)                                     /*!< the output value selection */
#define TIMER_CFG_CHVSEL                 BIT(1)                                     /*!< write CHxVAL register selection */
#define TIMER_CFG_CREPSEL                BIT(2)                                     /*!< the counter repetition register selection */
#define TIMER_CFG_CCUSEL                 BIT(3)                                     /*!< commutation control shadow register update select */
#define TIMER_CFG_OCPRECIVM              BIT(4)                                     /*!< output prepare signal clear invalid mode select */

/* constants definitions */
/* UPIFBU bit state */
typedef enum {VALID_RESET = 0, VALID_SET = 1, INVALID = 2} UPIFBUStatus;

/* TIMER init parameter struct definitions */
typedef struct {
    uint16_t prescaler;                                                             /*!< prescaler value */
    uint16_t alignedmode;                                                           /*!< aligned mode */
    uint16_t counterdirection;                                                      /*!< counter direction */
    uint64_t period;                                                                /*!< period value */
    uint16_t clockdivision;                                                         /*!< clock division value */
    uint32_t repetitioncounter;                                                     /*!< the counter repetition value */
} timer_parameter_struct;

